## Create a solution for both problems

In [109]:
import numpy as np
import pandas as pd

In [110]:
def csv_to_df(filename:str) -> pd.DataFrame:
    return pd.read_csv(filename)

In [145]:
def absolute_diff_of_two(df: pd.DataFrame, col_1: str, col_2: str) -> pd.Series:
    return abs(df[col_1] - df[col_2])

In [146]:
minimum_idx = lambda lst : lst.idxmin()

In [147]:
def column_name(df: pd.DataFrame, col_name: str, idx: int) -> str:
    return df[col_name][idx]

In [148]:
def solution_for_both(df: pd.DataFrame, col_1: str, col_2: str, col_name: str) -> str:
    abs_diff = absolute_diff_of_two(df, col_1, col_2)
    min_idx = minimum_idx(abs_diff)
    return column_name(df, col_name, min_idx)

### Try the generic solution for the football problem

In [149]:
football_filename = './football/football.csv'
df_football = csv_to_df(football_filename)

In [150]:
df_football.head()

                Team  Games  Wins  Losses  Draws  Goals  Goals Allowed  Points
0            Arsenal     38    26       9      3     79             36      87
1          Liverpool     38    24       8      6     67             30      80
2  Manchester United     38    24       5      9     87             45      77
3          Newcastle     38    21       8      9     74             52      71
4              Leeds     38    18      12      8     53             37      66

In [151]:
solution_for_both(df_football, 'Goals', 'Goals Allowed', 'Team')

'Aston_Villa'

### Try the generic solution for the weather problem

In [152]:
weather_filename = './weather/weather.csv'

In [153]:
df_weather = csv_to_df(weather_filename)

In [154]:
df_weather.head()

,Day,MxT,MnT,AvT,AvDP,1HrP TPcpn,PDir,AvSp,Dir,MxS,SkyC,MxR,Mn,R AvSLP
0,1,88,59,74,53.8,0,280,9.6,270,17,1.6,93,23,1004.5
1,2,79,63,71,46.5,0,330,8.7,340,23,3.3,70,28,1004.5
2,3,77,55,66,39.6,0,350,5.0,350,9,2.8,59,24,1016.8
3,4,77,59,68,51.1,0,110,9.1,130,12,8.6,62,40,1021.1
4,5,90,66,78,68.3,0,220,8.3,260,12,6.9,84,55,1014.4

In [155]:
solution_for_both(df_weather, 'MxT', 'MnT', 'Day')

14